app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    if params[:artists_id] && !Artist.exists?(params[:artist_id])